ra-rs/ra/svd/vendor/R7FA0E107.svd
                <register>
                    <name>RTCC0</name>
                    <description>Realtime Clock Control Register 0</description>
                    <addressOffset>0x000B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>CT</name>
                            <description>Fixed-cycle interrupt (RTC_ALM_OR_PRD) selection</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>Does not use fixed-cycle interrupt</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>Once per 0.5 s (synchronized with second count up)</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>Once per 1 s (same time as second count up)</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>Once per 1 m (second 00 of every minute)</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>Once per 1 hour (minute 00 and second 00 of every hour)</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>Once per 1 day (hour 00, minute 00, and second 00 of every day)</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Once per 1 month (Day 1, hour 00 a.m., minute 00, and second 00 of every month)</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AMPM</name>
                            <description>Selection of 12- or 24-hour system</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>12-hour system (a.m. and p.m. are displayed.)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>24-hour system</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTC128EN</name>
                            <description>Selection of the operating clock for the realtime clock (RTCCLK)</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>SOSC (32.768 kHz)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>SOSC/256 (128 Hz)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RCLOE1</name>
                            <description>RTCOUT pin output control</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables output of the RTCOUT pin (1 Hz)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables output of the RTCOUT pin (1 Hz)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCE</name>
                            <description>Realtime clock operation control</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stops counter operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Starts counter operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTCC1</name>
                    <description>Realtime Clock Control Register 1</description>
                    <addressOffset>0x000C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>RWAIT</name>
                            <description>Wait control of realtime clock</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Counting proceeds</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stops the SEC to YEAR counters. Counter values are readable and writable.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RWST</name>
                            <description>Wait status flag of realtime clock</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Counting is in progress.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Counter values are readable and writable.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RIFG</name>
                            <description>Fixed-cycle interrupt status flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Fixed-cycle interrupt is not generated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Fixed-cycle interrupt is generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WAFG</name>
                            <description>Alarm detection status flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Alarm mismatch</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Detection of matching of alarm</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WALIE</name>
                            <description>Control of alarm interrupt (RTC_ALM_OR_PRD)</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Does not generate interrupt on matching of alarm.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Generates interrupt on matching of alarm.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WALE</name>
                            <description>Alarm operation control</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Match operation is invalid.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Match operation is valid.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
